Repository: safoyeth/table-of-contents-plus-ru_RU
Catalog: table-of-contents-plus-*.po
Languages: ru_ru

source: Settings
ru_ru: Настройки

source: TOC
ru_ru: Содержание

source: Options saved.
ru_ru: Настройки сохранены.

source: Save failed.
ru_ru: Сбой сохранения.

source: Main Options
ru_ru: Главный настройки

source: Sitemap
ru_ru: Карта сайта

source: Help
ru_ru: Помощь

source: Position
ru_ru: Позиция

source: Before first heading (default)
ru_ru: До первого заголовка (по умолчанию)

source: After first heading
ru_ru: После первого заголовка

source: Top
ru_ru: Сверху

source: Bottom
ru_ru: Снизу

source: Show when
ru_ru: Показывать когда

source: or more headings are present
ru_ru: или более заголовков есть в тексте

source: Auto insert for the following content types
ru_ru: Автоматическая вставка для следующих типов контента

source: Heading text
ru_ru: Текст заголовка

source: Show title on top of the table of contents
ru_ru: Показывать текст заголовка вверху содержания

source: Eg: Contents, Table of Contents, Page Contents
ru_ru: Например, "Содержание", "Оглавление"

source: Allow the user to toggle the visibility of the table of contents
ru_ru: Позволять пользователю менять видимость содержания

source: Show text
ru_ru: Текст "Показать"

source: Eg: show
ru_ru: Например, "показать"

source: Hide text
ru_ru: Текст "скрыть"

source: Eg: hide
ru_ru: Например, "скрыть"

source: Hide the table of contents initially
ru_ru: Изначально показывать содержание в скрытом состоянии

source: Show hierarchy
ru_ru: Показывать иерархию

source: Number list items
ru_ru: Нумеровать содержимое

source: Enable smooth scroll effect
ru_ru: Включить плавную прокрутку

source: Scroll rather than jump to the anchor link
ru_ru: Прокручивать вместо того, чтобы резко переходить к якорю

source: Appearance
ru_ru: Появление

source: Width
ru_ru: Ширина

source: Fixed width
ru_ru: Фиксированная ширина

source: Relative
ru_ru: Относительная

source: Auto (default)
ru_ru: Автоматически (по умолчанию)

source: Other
ru_ru: Другая

source: User defined
ru_ru: Определённая пользователем

source: Please enter a number and %s select its units, eg: 100px, 10em
ru_ru: Пожалуйста, введите число и %s выберите единицы, например 100px, 10em

source: Wrapping
ru_ru: Позиция

source: None (default)
ru_ru: По умолчанию (над текстом)

source: Left
ru_ru: Слева

source: Right
ru_ru: Справа

source: Font size
ru_ru: Размер текста

source: Presentation
ru_ru: Цвет фона

source: Grey (default)
ru_ru: Серый (по умолчанию)

source: Light blue
ru_ru: Светло-голубой

source: White
ru_ru: Белый

source: Black
ru_ru: Чёрный

source: Transparent
ru_ru: Прозрачный

source: Custom
ru_ru: Пользовательский

source: Background
ru_ru: Фон

source: Border
ru_ru: Граница

source: Title
ru_ru: Заголовок

source: Links
ru_ru: Ссылки

source: Links (hover)
ru_ru: Ссылки (:hover)

source: Links (visited)
ru_ru: Посещённые ссылки (:visited)

source: Leaving the value as %s will inherit your theme's styles
ru_ru: Оставьте значение %s, чтобы унаследовать стили темы

source: Advanced
ru_ru: Расширенные

source: show
ru_ru: показать

source: Power options
ru_ru: Мощные опции

source: Lowercase
ru_ru: Нижний регистр

source: Ensure anchors are in lowercase
ru_ru: Переводить якори (#) в нижний регистр

source: Hyphenate
ru_ru: Дефисы

source: Use - rather than _ in anchors
ru_ru: Использовать - вместо _ в якорях

source: Include homepage
ru_ru: Включать домашнюю страницу

source: Show the table of contents for qualifying items on the homepage
ru_ru: Показать содержание для статей на главной странице

source: Exclude CSS file
ru_ru: Исключить CSS-файл

source: Prevent the loading of this plugin's CSS styles. When selected, the appearance options from above will also be ignored.
ru_ru: Предотвращает загрузку css для этого плагина. Если выбрано, то настройки появления, выбранные выше будут проигнорированы.

source: Preserve theme bullets
ru_ru: Поддержка оформления маркеров темы

source: If your theme includes background images for unordered list elements, enable this to support them
ru_ru: Если ваша тема включает изображения для маркеров списка, вам необходимо включить эту опцию для их поддержки

source: Heading levels
ru_ru: Уровни заголовков

source: Include the following heading levels. Deselecting a heading will exclude it.
ru_ru: Включать следующие уровни заголовков. Снятие галочки исключит заголовки из содержания.

source: heading
ru_ru: заголовок

source: Exclude headings
ru_ru: Исключать заголовки

source: Specify headings to be excluded from appearing in the table of contents. Separate multiple headings with a pipe <code>|</code>. Use an asterisk <code>*</code> as a wildcard to match other text. Note that this is not case sensitive. Some examples:
ru_ru: Определите заголовки, которые будут исключены из содержания. Разделяйте их вертикальной чертой <code>|</code>. Используйте звёздочку <code>*</code> для обозначения прочего текста. Обратите внимание, что этот параметр не чувствителен к регистру. Несколько примеров:

source: <code>Fruit*</code> ignore headings starting with "Fruit"
ru_ru: <code>Fruit*</code>проигнорирует заголовки, начинающиеся с "Fruit"

source: <code>*Fruit Diet*</code> ignore headings with "Fruit Diet" somewhere in the heading
ru_ru: <code>*Fruit Diet*</code> проигнорирует заголовки, если где-либо в них встречается словосочетание "Fruit Diet"
